[{"username": "buizel123", "type": "comment", "content": "from Wikipedia : \n\n[GovTrack](https://en.wikipedia.org/wiki/GovTrack) has rated him the most conservative Democrat in the House as of February 2021, as well as more conservative than 32 House Republicans. During [Donald Trump](https://en.wikipedia.org/wiki/Donald_Trump)'s presidency, Gottheimer voted in line with Trump more often than any other Democrat in Congress.\"\n\nYeah that's a NO from me... dawg.", "score": 230, "created_utc": 1731702549.0}, {"username": "Sophist_Ninja", "type": "comment", "content": "I don’t have time to address everything you wrote, but I will soon. I am honestly apprehensive to do so, however, because you have left several tells in your message that indicate you’re not entirely grounded in reality despite what you think. You are conspiratorial (bringing up Hunter Biden and ignoring the fact that he was convicted—just not punished enough to your liking, I suppose—while also failing to mention Trump’s legal woes of which, if any normal citizen were guilty of, they’d have been locked up in prison a long time ago. But I bet you believe that’s a witch hunt and weaponization of government or “lawfare,” whatever the right wing talking heads are calling it today. Further, the fact that you claim justthenews.com is a trustworthy source of information is jaw-dropping considering they make it readily apparent that they have a strong right wing bias (https://mediabiasfactcheck.com/just-the-news/), but you’ll probably call that fake news and continue to eat it up.\n\nAlso, my success has nothing to do with your imaginary friend(s). I worked my ass off and got to where I am through sacrifice and intelligence. If god is responsible for my success, he’s equally as responsible for all the bad that happens too since he’s all powerful and omnipotent. Do you thank god for the hurricanes that swept through the south recently? It’s literally a natural occurrence, sometimes referred to as an “act of god.”\n\nI’m sorry you’re struggling so hard. I wish your prayers would actually be met with blessings instead of hardship (maybe try praying harder? I don’t know why it’s not working). I’ll accept your personal experience of struggling as a part of the middle class, but I won’t accept you speaking for “other middle class people.” Unless they’re sending you bank statements and itemized lists of their monthly expenses, you have no idea how they’re truly doing. Financial literacy is not equal among all people and there are plenty of people who make irresponsible choices with their money regardless of how much they make. I have to laugh when people are complaining about not being able to afford the price of eggs while they’re decked out in their Trump shirt, gold Trump shoes, red MAGA hat, a Trump bible in one hand and a Trump flag in the other, only to then immediately pivot to how this Trump rally in Pennsylvania is the 35th one they’ve attended thus far despite living in Florida.\n\nAnd don’t get me started on the boat parades. If you own a boat and you use it, there is no room for complaining about money. I own a boat. I use my boat. I recognize that my boat is a luxury purchase and so are all those center console boats I see on the news flying Trump flags (and sometimes Nazi flags too, it seems). But again, these are the same people whining about how the middle class is being destroyed at the pump and grocery store. The cognitive dissonance is palpable.\n\nComparing gas prices today to 10 years ago is a display of sheer ignorance. Why stop there? Why isn’t gas .95 cents a gallon like it was in 1990?!? This country is going to hell in a handbasket (/s)! And I’m not even going to go into the fact that The United States produced more crude oil than any nation at any time, according to the U.S. Energy Information Administration’s International Energy Statistics, for the past six years in a row. So Trump’s plan to “drill, baby, drill” just means more of what is already happening, yet he thinks it will be some kind of an economic windfall when HE does it. It’s almost as if there are external factors that move the price of gas. Factors controlled by individual sovereign countries and economic organizations like OPEC. I only brought up the price of gas being reasonable as a preemptive argument because people love to harp on it as if the United States Presidential Administration unilaterally sets the price (see those childish “I did that!” stickers that were showing up on pumps). If gas is too expensive, buy a fuel efficient car. Again, the same people crying about these prices are doing it through the window of a lifted Ford F-250 Super Duty while towing their aforementioned boats.\n\nYes, some people are genuinely struggling, I’m not discounting that. There are plans for that, though helping those who struggle is decried by the right as “socialist, communist, AND fascist” as if they can be all three at once.\n\nLastly, if you don’t think Donald Trump is a threat to democracy, you’re not paying close enough attention. He talks about arresting dissidents and political opponents (for no reason… not for legitimate things like taking and willfully withholding classified documents, trying to illegally influence an election, inciting an insurrection, etc.) We are indeed a democratic country (yes, a “constitutional republic,” but a democratic one nonetheless) and for that to work requires trust and faith in our government institutions. Trump has destroyed so much through his constant lies about whatever and whoever isn’t loyal to him that half our country subscribes to conspiratorial nonsense. They eat it up without any evidence and have developed the ability to dismiss obvious truths. His rhetoric has absolutely torn the fabric of democracy to the point where there are far too many people that believe our voting system lacks integrity when it is demonstrably one of the most secure in the world. Him and his ilk never ONCE provided evidence to back up their claims… ever. I encourage you to read the 1,889 pages of evidence and testimony that was unsealed today and read for yourself what people in his very own camp and political party had to say about his failed attempt to stay in office. But you won’t, I know.\n\nAnyway, I know this was all a huge waste of time because you’ll just write it all off and you’ll keep consuming the lies you’ve come to love. Go ahead, be the side that cheers on the death of democracy. The truth is you are the minority (about 30% of eligible voters). If it weren’t for the Electoral College, that cancerous party would be a relic of the past a long time ago.\n\nBy the way, this is all coming from a former registered Republican who voted for Trump in 2016 and left the party just after January 6th. Those people don’t represent me even a little and I’m willing to bet that they won’t represent you the way you think they will. You are not the chosen one that won’t be chewed up and spit out just like many others who hitched their wagons to Trump and are now criticized as being the worst of the worst despite once being part of what he himself claims were “the best people.”\n\nWake up! No need to respond. This was therapeutic. Have a good one.", "score": 1, "created_utc": 1729285577.0}, {"username": "kinggeedra", "type": "comment", "content": "Donald Trump 🤝 The Taliban\n\n“Women’s happiness freaks me out.”", "score": 1, "created_utc": 1730631203.0}, {"username": "Metro42014", "type": "submission", "content": "Donald Trump booed at Davos after attacking 'nasty, mean, fake' press ", "score": 31359, "created_utc": 1516974492.0}, {"username": "svrtngr", "type": "comment", "content": "Trump's 2016 run was \"The Producers,\" where they tried to do everything possible to lose and ended up winning anyway. \n\nTrump 2024 is America being forced to live through an Armando Ianucci satire.", "score": 2, "created_utc": 1731517459.0}, {"username": "ThinkerSis", "type": "submission", "content": "Donald Trump Declares His Hatred for Taylor Swift in Wild Truth Social Post ", "score": 867, "created_utc": 1726424199.0}, {"username": "ThinkerSis", "type": "submission", "content": "How Kamala Harris Became Bigger than Donald Trump ", "score": 1243, "created_utc": 1723166129.0}, {"username": "CrackHeadRodeo", "type": "submission", "content": "Trump sparks outrage after calling for army to handle enemies on election day | US elections 2024 ", "score": 428, "created_utc": 1728946938.0}, {"username": "CrackHeadRodeo", "type": "submission", "content": "Donald Trump a de facto Russian asset, FBI official he fired suggests. ", "score": 783, "created_utc": 1726143651.0}, {"username": "filmfan10", "type": "comment", "content": "Okay. At this point, the New York Times is running interference for Donald Trump.\n\n\n\nThe New York Times published this 3 days ago. This didn't age well:\n\nThe Taylor Swift Endorsement Fantasy\n\n[https://www.nytimes.com/2024/09/08/opinion/taylor-swift-endorsement-election-harris.html](https://www.nytimes.com/2024/09/08/opinion/taylor-swift-endorsement-election-harris.html)\n\n\n\n  \nTaylor just endorsed Kamala:\n\n[https://www.instagram.com/p/C\\_wtAOKOW1z/?igsh=NGt2czk2b2E1cnhj](https://www.instagram.com/p/C_wtAOKOW1z/?igsh=NGt2czk2b2E1cnhj)", "score": 33, "created_utc": 1726024377.0}, {"username": "NeoMegaRyuMKII", "type": "comment", "content": "> Like when Joe Rogan, thinking Joe Biden had said that there were airports during the Revolutionary War, claimed that saying something so stupid disqualified him from being President. Rogan's producer then informed him that it was actually a quote from Donald Trump.\n\nThis is only about two thirds of the story and ridiculousness. The missing part is that when Rogan was informed of this, he went on to defend Convicted Felon Tweetle Dumb, saying he misspoke and everyone does that. \n\nHe believed it was disqualifying when he thought Biden said it, but that it was a non-issue when knowing the other guy said it.", "score": 10, "created_utc": 1728851658.0}, {"username": "majorchamp", "type": "submission", "content": "What is going on with Adin Ross possibly committing a campaign donation violation to Donald Trump? [removed]", "score": 1, "created_utc": 1722910197.0}, {"username": "majorchamp", "type": "submission", "content": "Supporters of Donald Trump, what did you honestly think of his speech last night? ", "score": 0, "created_utc": 1721400103.0}, {"username": "Fragrant-Discount960", "type": "comment", "content": "What gets missed is the 12 yr old “Maria” who was there as well, and is detailed by Katie Johnson.\n\n*a 2016 lawsuit against co defendants Donald trump and convicted child rapist Jeffrey Epstein. Where Katie Doe charged that she was raped by both men when she was 13. The plaintiff provided 2 witness affidavits and in her complaint mentions a threat that if she ever talked she would 'wind up like Maria'. Mr. Madsen believes he has identified Maria as an 11 year old girl that was abducted from in front of a Waterbury pizzeria.*\n\n[https://www.scribd.com/document/483824386/Case-1-16-cv-04642-Missing-Maria](https://www.scribd.com/document/483824386/Case-1-16-cv-04642-Missing-Maria)", "score": 2, "created_utc": 1730489650.0}, {"username": "UWCG", "type": "comment", "content": ">[Trump Guitars, the company behind a line of Donald Trump-endorsed acoustic and electric instruments, has been issued a cease and desist order from Gibson, the famous 130-year-old guitar manufacturer.](https://www.huffpost.com/entry/trump-guitars-gibson-cease-and-desist_n_6745e4b8e4b0fffc5a467660)\n\nHim endorsing a guitar still gets an eye-roll from me—he doesn't play *any* instrument, does he? Why would you care if he endorsed a guitar?\n\nOh, well, either way, good for Gibson.", "score": 10, "created_utc": 1732651765.0}, {"username": "UWCG", "type": "comment", "content": ">[Trump Guitars, the company behind a line of Donald Trump-endorsed acoustic and electric instruments, has been issued a cease and desist order from Gibson, the famous 130-year-old guitar manufacturer.](https://www.huffpost.com/entry/trump-guitars-gibson-cease-and-desist_n_6745e4b8e4b0fffc5a467660)\n\nHim endorsing a guitar still gets an eye-roll from me—he doesn't play *any* instrument, does he? Why would you care if he endorsed a guitar unless you're a diehard cult member?\n\nOh, well, either way, good for Gibson.", "score": 15, "created_utc": 1732649526.0}, {"username": "UWCG", "type": "comment", "content": ">Donald Trump said on Monday that on his first day in office he would impose a 25% tariff on all products from Mexico and Canada, and an additional 10% tariff on goods from China, citing concerns over illegal immigration and the trade of illicit drugs.\n\nWell, that's not going to go over well with the economy...", "score": 8, "created_utc": 1732581928.0}, {"username": "UWCG", "type": "comment", "content": "> Dan Goldman, a prosecutor turned New York Democrat and member of the House oversight committee, lamented “a shame for justice in this country”.\n> \n> “It establishes that Donald Trump is above the law,” Goldman told CNN. “The supreme court put him above the law [by ruling that he had ‘absolute immunity’ for official acts] but now he appears to escape full accountability for what were crimes charged by a grand jury.”\n\n[Source](https://www.theguardian.com/us-news/2024/nov/25/trump-criminal-case-dismissed-democrats-react); pretty spot-on. The follow-up stings, too, but I think he's accurate in that the new incoming administration is way overstepping their perceived \"mandate\"—but I don't know there's much chance of stopping that cause dipshit voters already stuck us in this situation.\n\n>“I think what was very clear is that people voted for Donald Trump because they thought that he was going to improve the lives of the middle class, and perhaps in addition that he would secure the border,” Goldman said. “They did not vote for him to dismantle our democracy, to attack the constitution, to politicize all of our agencies, and certainly not as a referendum on his criminal cases.\"", "score": 12, "created_utc": 1732579538.0}, {"username": "UWCG", "type": "comment", "content": ">[Jack Smith Leaving Option to Charge Donald Trump in the Future](https://www.newsweek.com/jack-smith-donald-trump-charges-future-case-1991485)\n\nGiven Donald's age, health, and all, I don't think there's much chance of that, but I guess it's a tiny bit of a salve on the sting of all the dropped charges", "score": 4, "created_utc": 1732577414.0}, {"username": "UWCG", "type": "comment", "content": ">[Donald Trump ally warns Keir Starmer the US will ‘crush’ the UK economy if it helps arrest Benjamin Netanyahu](https://www.independent.co.uk/news/uk/politics/donald-trump-starmer-arrest-netanyahu-economy-b2652482.html)\n\nLet's be honest, this is kinda a hollow threat: he's probably gonna wreck the US economy and the fallout'll impact the UK either way", "score": 25, "created_utc": 1732413037.0}, {"username": "UWCG", "type": "submission", "content": "Donald Trump Backs Out Of Yet Another Scheduled Appearance ", "score": 2881, "created_utc": 1729623562.0}, {"username": "UWCG", "type": "submission", "content": "Donald Trump AG's 'Unusual' Behavior Detailed by Muller Investigator ", "score": 414, "created_utc": 1727459478.0}, {"username": "UWCG", "type": "submission", "content": "North Carolina Democrat on his opponent: ‘Robinson exists because Donald Trump has lifted him up’ ", "score": 2506, "created_utc": 1727028088.0}, {"username": "fuckassmcgillicutty", "type": "comment", "content": "How am I actually seeing people think Donald Trump won? It has to be a joke right", "score": 8, "created_utc": 1726024364.0}, {"username": "anti_hope_dealer", "type": "comment", "content": "“I’m Jeff Bezos, and despite being one of the richest and most powerful people in the world, I’m terrified of Donald Trump. You should be, too.”", "score": 16, "created_utc": 1730320720.0}, {"username": "MrChainsaw27", "type": "comment", "content": "Why are you supporting Donald Trump, a known associate and close friend of Jeffrey Epstein, convicted pedophile and child sex trafficker?", "score": 1, "created_utc": 1730751248.0}, {"username": "MrChainsaw27", "type": "comment", "content": "Then why are you supporting Donald Trump, a known associate and close friend of Jeffrey Epstein, convicted pedophile and child sex trafficker?", "score": 2, "created_utc": 1730751152.0}, {"username": "ceddya", "type": "comment", "content": ">Kamala hat more than 3 times the budget of trump.\n\nhttps://www.opensecrets.org/2024-presidential-race/kamala-harris/candidate?id=N00036915\n\nhttps://www.opensecrets.org/2024-presidential-race/donald-trump/candidate?id=N00023864\n\nIt's not even close to more than 3 times.\n\n>>Why is noone asking who gave her that much money?\n\nHarris raised more than Trump overall because voters donated to her campaign more. Go see the difference in small individual contributions in the link above.\n\n>Both sides are paid by billionaires, one is just open about it.\n\n- In this election cycle, billionaires have flexed their muscles more than ever before. According to a new report by Americans for Tax Fairness, 150 billionaire families have spent a total of $1.9 billion (€1.75bn) in support of presidential and congressional candidates this cycle, 58% more than four years ago.\n\n- Roughly $570 million (€525m) have gone to Donald Trump's campaign, $130 million (€119.7m) to Kamala Harris. Bill Gates and Michael Bloomberg each gave $50 million (€46m) to Harris.\n\nTrump received far more from billionaires than Harris did.  And of course the irony being that Musk is the biggest perpetrator of this problem:\n\n- Of course, no single individual has donated more money than Elon Musk, who has become an aggressive Trump surrogate, pouring at least $118 million (€108.7m) into a pro-Trump Super PAC.\n\nhttps://www.euronews.com/2024/11/01/us-elections-explained-who-are-the-billionaires-pumping-millions-into-trump-and-harris-cam\n\nBetter question to ask is where you're getting your disinformation from and why you're pushing it on reddit.", "score": 9, "created_utc": 1732619284.0}, {"username": "WhileFalseRepeat", "type": "comment", "content": "Thanks for taking the time and welcome.\n\n1) How many TRUE, MOSTLY TRUE, HALF TRUE, MOSTLY FALSE, FALSE, and PANTS ON FIRE statements has Donald Trump made in his lifetime per Politifact? \n\n2) Do you think we will soon have reliable fact-checking in real-time with the help of AI? How, if at all, does Politifact currently use AI?", "score": 2, "created_utc": 1730739547.0}, {"username": "WhileFalseRepeat", "type": "comment", "content": "So - if Kamala Harris had mimicked oral sex on a microphone compared to Donald Trump actually mimicking oral sex on a microphone. The media would be very different, huh?", "score": 35, "created_utc": 1730702241.0}, {"username": "WhileFalseRepeat", "type": "comment", "content": "> The vast majority of Puerto Ricans in Florida back Vice President Kamala Harris’ White House bid and have a negative view of former president Donald Trump, according to a survey released days after a comedian made offensive comments about Puerto Rico at a Trump rally. \n> \n> The Puerto Rico Research Hub at the University of Central Florida polled about 150 Puerto Ricans who predominantly live in Central Florida through an online survey in the last half of October. They found that 85% of those polled would vote for Harris while only 8% said they supported Trump. Six percent said that they would vote for an alternative candidate. The poll has a margin of error of plus or minus 8 percentage points.\n> \n> The researchers said that they received a lot of responses to their poll after the New York City rally and noted the incident’s close proximity to Election Day.\n\nAs a Floridian, I’m not sure how much of an impact the Puerto Rican vote will have in my state - but I’m positive this is representative of other Puerto Ricans in other areas of the country and in states which are more in play and vital to the election outcome.\n\nPennsylvania has around 473,000 Puerto Rican residents, according to the Census Bureau’s 2022 American Community Survey.\n\nThe number one rule with Puerto Ricans... is you don't fuck with Puerto Rico.\n\nhttps://x.com/KamalaHQ/status/1852373251369976151", "score": 33, "created_utc": 1730496794.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Elders are removed from Texas megachurch in latest fallout from Trump pal’s sex abuse scandal | Robert Morris previously served on Donald Trump’s faith advisory board ", "score": 396, "created_utc": 1730749159.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Donald Trump hired him to find voting fraud. He debunked it instead | Analyst: ‘Every single claim they asked me to look at was false.’ ", "score": 10931, "created_utc": 1730394364.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Pageant Queen Shares Horrifying Details of Trump Sexual Assault | Beatrice Keul, a former pageant queen in New York, is now the twenty-eighth woman to accuse Donald Trump of sexual misconduct. ", "score": 3938, "created_utc": 1730390483.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Mark Cuban says Trump ‘absolutely’ has ‘fascist tendencies’ | “I do believe Donald Trump poses a threat,” the billionaire entrepreneur said. ", "score": 300, "created_utc": 1730141154.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "A former model says Donald Trump groped her years ago in a ‘twisted game’ with Jeffrey Epstein ", "score": 556, "created_utc": 1729962125.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Jeff Bezos Proves He’s a Coward With Washington Post Endorsement News | The “Democracy Dies in Darkness” paper just made a pathetic decision that can only be explained by Jeff Bezos bowing to Donald Trump. ", "score": 10556, "created_utc": 1729878175.0}, {"username": "WhileFalseRepeat", "type": "submission", "content": "Donald Trump accused of sexually assaulting woman Jeffrey Epstein brought to him ", "score": 947, "created_utc": 1729871019.0}, {"username": "winterfoxes", "type": "comment", "content": "White people were the majority vote for Trump in 2020. They were the majority vote for Trump in 2016. They were the majority vote for Romney in 2012. They were the majority vote for McCain in 2008... do you see the pattern here??? \n\nThe story this election isn't OMG, WHITE PEOPLE ARE AT IT AGAIN. Duh. Of fucking course white people voted for a Republican. The story of this election is how Donald Trump picked off Latino voters, Arabic voters, Desi voters, and Native American voters by MULTIPLE percentage points. Black men marginally voted more for Trump this year than they have in the past, but not to the extent we saw other races move the needle.  \n  \nSo on one hand, white people white peopled this election. Didn't do anything different than white people always do. If you were expecting them to and you're shocked, that's on you. \n\nAnd actually... as a matter of fact... white people voted MORE for Harris this year than they did for Biden in 2020. By 3 percentage points! Meaning the measurable percentage of extra votes that Donald got? Didn't come from white people. They came from people of color. \n\nIt was people of color who turned out and voted IN LARGER NUMBERS THAN THEY DID IN 2020 OR 2016, and those votes went for a man who said multiple times he was going to let Netanyau finish the job in Palestine, and who said he was going to deport legal citizens. That's not white people's fault. That's people of color abandoning each other and throwing each other under the bus in hopes that maybe they'll be thought of as 'one of the good ones'.", "score": 13, "created_utc": 1731017051.0}, {"username": "groolthedemon", "type": "comment", "content": "I've never understood why it comes down to single issues with people. You don't have to \"believe in\" abortion. The biggest lie ever told is the one conservative \"pro life\" nitwits started about whether or not you believe in a medical decision. If it isn't for you then don't get one if that is what your faith says. Meanwhile, the medical procedures and drugs for abortive measures exist for reasons. Reasons that other people that don't have the same faith as you might require at some point in their lives. That is why we have the establishment clause. \n\nWe live in a secular country where you are allowed to have whatever faith you want via freedom of religion, but that is a two way street. Ultimately, the Constitution, and all law for that matter, as a general rule set for society supersedes anything in any other text you may or may not believe in. The law has to cover everyone regardless of their beliefs. \n\nThere's lots of things I like and dislike about the government and how things are run, but I would never let it come down to one issue. For me, in this election it comes down to the fact that we are living in a post truth, post satire world thanks to Donald Trump. You have one side that believes in facts, figures, studies, and seeking the truth and the other side which makes up lies, projects, and wishes for only chaos. It is night and day. You either fight with the fascist rhetoric or against it. There is no middle ground. \n\nSo, are you a fascist sympathizer or are you not? Has your mother thought about the potential repercussions of another Trump administration or is she literally stuck on this one thing? What about the economy, civil rights, the border, police and prison reform, immigration reform, healthcare reform, our standing on the world stage, education reform, child care reform, the environment or the myriad of other issues Harris and Walz actually have a standing on unlike the Trump administration which has ZERO PLATFORM. \n\nIt really sucks that her not voting is ultimately equal to just giving a vote to Trump, but its a free country. If she doesn't want to participate then I guess she shouldn't complain if Trump wins, the pogroms start, and they drag her ass off to a prison camp to die somewhere.", "score": 3, "created_utc": 1730459677.0}, {"username": "reftheloop", "type": "submission", "content": "Donald Trump's COVID-19 Diagnosis Is Forcing Him to Face His Personal—and Political—Vulnerability ", "score": 48, "created_utc": 1602177316.0}, {"username": "reftheloop", "type": "submission", "content": "Donald Trump Campaign’s Use Of ‘Hallelujah’ Draws Rebuke From Leonard Cohen’s Estate, Sony/ATV ", "score": 805, "created_utc": 1598678339.0}, {"username": "MethBearBestBear", "type": "comment", "content": "Donald Trump was elected to a second non consecutive term. Absolutely absurd", "score": 3, "created_utc": 1732413592.0}, {"username": "l---____---l", "type": "comment", "content": "\"Republicans need to do better earning back trust, and Donald Trump is the man to do it.\"", "score": 6, "created_utc": 1727833888.0}, {"username": "Ron_Biggs", "type": "comment", "content": "Donald Trump is an agent of chaos that puts his own self interest above national interests. If this was Rome, he'd be Nero.", "score": 13, "created_utc": 1726020349.0}, {"username": "Ron_Biggs", "type": "comment", "content": "The United States pulled out of the JCPOA. And now Iran has enough fissionable material to create something like 4 or more nuclear bombs. \n\nWhose fault is that? Donald Trump.", "score": 3, "created_utc": 1726020166.0}, {"username": "Ron_Biggs", "type": "comment", "content": "Well here we go. Hoping for the best, expecting the worst, and wishing it convinces enough people to vote to end the political career of Donald Trump.", "score": 8, "created_utc": 1726016458.0}, {"username": "motherofspoos", "type": "comment", "content": "Fuck YES, they should be.  We are fucking PISSED.  I'm 66 and remember my mother's stories about coat hangers. The fact that these fucks think we're going back to that time is INSANE.  Donald Trump made the fatal mistake.  He underestimated women.  Way, wayyyyyyyyyyyyyyyyyyyyy underestimated women.  Once Kamala is president we are, collectively, going to push to throw his old white ass in jail.  And then start on the other old white asses.  I'm white, and I don't know a single woman my age or younger who voted for him.  The only woman I know who voted for him is an old, old racist.  But I'm in NC, there's bound to be a few of those around still.  Too old to know what it's like for a guy to knock a girl up and then ghost her.  Any woman voting for Trump is married, I guarantee it, and has never had sex outside marriage, or dreaded when she was a day late.  Fuck this.", "score": 9, "created_utc": 1730524211.0}, {"username": "holdyourjazzcabbage", "type": "comment", "content": "Others have responded, but I want to underscore this so we stop saying \"half the country.\"\n\nRepublicans are about one third of the country (Dems and indies are too)  \nAmongst this 33%, Trump has about an 87% approval rating  \nAmongst Indies his approval is about 36%  \nRepublicans lose the popular vote almost every time in the modern era\n\nThis is not a 50/50 country.\n\nThis is a country that hates Donald Trump but because of the electoral college and the two party system, if you sorta kinda squint you can sort of think of them as competitive. They're not. And every time we say \"half of America\" we're giving them too much credit.", "score": 299, "created_utc": 1728353332.0}, {"username": "thatonegirl127", "type": "comment", "content": "A woman running against Donald Trump just said he is a rapist. Girl fucking dinner.", "score": 70, "created_utc": 1726018739.0}, {"username": "0o0o0o0o0o0z", "type": "comment", "content": "> I like to imagine a crazy new reality where a newly empowered Donald Trump is actually really pissed off at Putin for pulling his strings all these years\n\nTrump is a pussy, period.", "score": 26, "created_utc": 1732652730.0}, {"username": "jayfeather31", "type": "submission", "content": "Donald Trump Pulls Ahead of Kamala Harris With Six Bookmakers ", "score": 0, "created_utc": 1725379538.0}, {"username": "jayfeather31", "type": "submission", "content": "Weakening economy and volatile markets open door for Donald Trump ", "score": 0, "created_utc": 1723232048.0}, {"username": "PoliticsModeratorBot", "type": "submission", "content": "Megathread: Donald Trump is elected 47th president of the United States After winning the key battleground state of Wisconsin early this morning, Donald Trump is projected to win the election and become the 47th President of the United States\n\n___________\n# Articles that May Interest You\n\n| Submission                                                                                    | Domain            |\n|-----------------------------------------------------------------------------------------------|-------------------|\n| [Trump wins the White House in political comeback rooted in appeals to frustrated voters](https://apnews.com/article/election-day-trump-harris-white-house-83c8e246ab97f5b97be45cdc156af4e2)       | apnews.com        |\n| [Live election updates: Donald Trump wins US presidency](https://apnews.com/live/trump-harris-election-updates-11-5-2024) | apnews |\n| [Trump will win second term, CNN projects, after historic comeback after losing four years ago](https://www.cnn.com/2024/11/06/politics/trump-wins-election/index.html) | cnn.com           |\n| [Donald Trump returns to the White House](https://www.politico.com/news/2024/11/06/donald-trump-wins-presidency-00187478)                                                       | politico.com      |\n| [Donald Trump defeats Kamala Harris to win the presidency](https://www.independent.co.uk/news/world/americas/us-politics/trump-wins-election-result-2024-president-b2635818.html)                                      | independent.co.uk |\n| [US election results 2024 live: Trump wins to become 47th president]()                            | thetimes.com      |\n| [Donald Trump defeats Kamala Harris to win 2024 presidential election](https://www.cnbc.com/2024/11/06/trump-wins-2024-election-for-president.html)                                                            | cnbc.com          |\n| [Donald Trump has won the presidential election and will return to the White House](https://www.npr.org/2024/11/06/nx-s1-5180057/donald-trump-wins-2024-election)             | npr.org           |\n| [How Donald Trump Pulled Off the Greatest Comeback in Political History](https://www.newsweek.com/donald-trump-wins-election-victory-kamala-harris-1981088)                        | newsweek.com      |\n| [Donald Trump Defeats Kamala Harris, Wins Back The White House](https://www.dailywire.com/news/donald-trump-defeats-kamala-harris-wins-back-the-white-house)                                 | dailywire.com     |\n| [Trump wins presidency for second time, completing improbable comeback](https://thehill.com/homenews/campaign/4969061-trump-wins-presidential-election/) | thehill.com |\n| [Donald Trump will be the 47th president of the United States](https://www.csmonitor.com/USA/Politics/2024/1106/trump-wins-election-2024) | csmonitor.com |\n| [Victorious Trump will likely test democratic institutions at home and abroad](https://www.reuters.com/world/us/trump-secures-white-house-comeback-victory-defeating-harris-2024-11-06/) | reuters.com |", "score": 18750, "created_utc": 1730890323.0}, {"username": "ClaretClarinets", "type": "comment", "content": "Also, every time there's a town hall for either candidate, when they interview undecided voters afterwards, a not-insignificant amount of them say they'll vote for Harris (or at least *not* Donald trump). \n\nHe's peeling away his own voters with his behavior at his events. Every time he shows up 3 hours late or leaves his supporters stranded after a rally, he loses more votes he would otherwise easily keep.", "score": 51, "created_utc": 1730072862.0}, {"username": "heytheremicah", "type": "comment", "content": "Well yes… people that already had money on the right AND left surely did benefit more from his policies. They’ll probably benefit again with a new Trump presidency.\n\nIt’s just continuing the wealth gap disparity between the 1% and the working class in this country. \n\nPeople complaining about Trump’s tax cuts benefitting them back in 2017 compared to now fail to recognize that we’re still on Trump’s 2017 law through 2025. This **is** what they voted for… (link below for the consequences of his tax program)\n\nhttps://www.cbpp.org/research/federal-tax/the-2017-trump-tax-law-was-skewed-to-the-rich-expensive-and-failed-to-deliver\n\nThat’s why it’s not pearl clutching from the left. It’s policy designed by the Republicans to be significantly damaging to the working class years down the road while maximizing corporate profits (their donors). Just because people on the right refuse to acknowledge doesn’t mean that it’s not real.\n\nEven if Donald Trump was great for the economy for the general population, I still wouldn’t vote for him because of his absolute lack of knowledge on almost every other social, environmental, and political issue. \n\nIt’s 2024. The newly elected president of the richest, most powerful country in the world absolutely cannot call climate change a “hoax” and joke about more “ocean front property.” That alone is a damning and disqualifying platform for me.", "score": 5, "created_utc": 1732387981.0}, {"username": "heytheremicah", "type": "comment", "content": "You’re also proving their point too… \n\nThey aren’t calling you a Trump supporter for thinking it’s only one way or another. They’re saying that you, like many Americans, are falling for an exceptionally sophisticated, intricate network of misinformation and propaganda. \n\nCan, Democrats be a better opposition party? Yes, however the amplification of the idea that they’re a useless, ineffective party when they’re the only other realistic choice to achieve climate goals, civil/social justice IS part of the propaganda network.\n\nThere are only two options is this country and barring a complete collapse of the system, there will only be two options. Attacking the character of the opposition party is just one of many ways to delegitimize them.\n\nFor Republican voters, this delegitimization of character might be calling Harris “dumb, weak, unqualified.” \n\nFor Independent voters, it’s attacking her from a class perspective that she’s an elitist, which posing their candidate (a billionaire that’s never had to work a day in his life) as a man of the working class.\n\nFor leftists, it’s attacking her character by claiming she’s the same as Biden and then amplifying that message on social media with Pro-Palestinian account which by all metrics she WOULD be better than Donald Trump. Even the current status quo with the possibility of a two-state solution is better than what Trump is proposing.\n\nIt’s a damn, impressive and frankly terrifying level of propaganda that’s been so successful thanks to decades of Department of Education cuts and demonization of education and higher learning.", "score": 1, "created_utc": 1731461722.0}, {"username": "heytheremicah", "type": "comment", "content": "You missed their point “Oligarchy bad when Democrats are in office. Oligarchy good when Donald Trump is president because oligarch makes rockets.”", "score": 2, "created_utc": 1731109852.0}, {"username": "heytheremicah", "type": "comment", "content": "The issue isn’t JUST Trump. The proof is that historically when Republicans are elected they work as a bloc to get legislation passed. Part of the reason to Democratic Party is so ineffective is infighting and apathy. \n\nAt the end of the day, Donald Trump is a populist first and a Conservative second. However, his party is much further to the right than he is and WILL attempt to pass legislation that he might seem/act moderate about. You can see this with him saying “he’ll protect women” (vague statement) while Republican states actively restrict abortion at the state level. While they limit it at the state level they talk about expanding this to a federal level, and they do the same thing with lgbt rights. \n\nWhen you have EXPERTS in economics, people with phDs and decades of experiences, almost all saying that his plans of tax cuts, tariffs, and mass deportations will cause the GDP to shrink nearly 9% and inflation to rise 2+% causing a financial situation worse than the Great Recession you *should* listen to them. When you have climate scientists telling you the time is NOW to act on energy changes and the environment and you have Donald Trump and the GOP clamoring for more fracking and oil drilling in the Plain States, who should you listen to? It **IS** a lack of critical thinking and common sense, because voter’s would rather ignore all the empirical evidence in front of them, because of their feelings of the economy which we’ve proven he wouldn’t be any better. Not to mention the public memory is so short that the entire reason the cost of living rapidly increased and largest wealth disparity is due to his tax cuts in 2016 that are gradually increasing the middle classes taxes until 2026 to offset top 1% tax cuts. Not to mention the collapse of our supply-chain systems and rapid printing of money to keep the stock market afloat due to his poor Covid response.\n\n\nEdit: Before someone says I live in an echo chamber, I live in a +21 R county and work in an even smaller rural agricultural community. The fact that I had to explain to older coworkers that A.) land doesn’t vote which is why our state turned blue when 75% of our state lives in that metro area B.) that tariffs hurt farmers which is why farmers had Harris signs, explains a lot about our current political situation", "score": 2, "created_utc": 1730982140.0}, {"username": "heytheremicah", "type": "comment", "content": "Obama was president and the incumbent going into 2012 though? Donald trump was not president the past four years. Again, I’m not saying that Harris should have avoided a primary. I’m in agreement there", "score": 1, "created_utc": 1730947087.0}, {"username": "TinkCzru", "type": "comment", "content": "“I love the poorly educated”— Donald Trump\n\n\nNo truer words were ever said. And this is specifically why they want to dismantle the Department of Education. They tell us every day what they wanna do. And the ones who are “educated” are so self-interested that they do not care as well.", "score": 1, "created_utc": 1730787584.0}, {"username": "TinkCzru", "type": "submission", "content": "Judge Cannon dismisses classified documents case against Donald Trump  ", "score": 29, "created_utc": 1721051976.0}, {"username": "BShepard93", "type": "comment", "content": "The mic mute agreement was only followed by Kamala Harris, certainly not Donald Trump and unfortunately not ABC.", "score": 1, "created_utc": 1726022600.0}, {"username": "Dianneis", "type": "comment", "content": "Made up by whom? The American people? He was convicted unanimously by a jury of his peers that had nothing to do with the Democratic party.\n\nAnd what about the rest of the stuff he was found guilty of? I'm talking about two separate unanimous juries finding him guilty of sexual assault, as well as a crapload of other stuff – like the charity, university, and housing discrimination scandals – that happened way before his first run. Here's an incomplete list:\n\n>[Trump Org. fined $1.6 million after conviction for 17 felonies, including tax fraud](https://www.cnn.com/2023/01/13/politics/trump-org-sentencing/index.html)\n\n>[Trump and his children accused of using charitable foundation ‘like a piggy bank’ ](https://www.pbs.org/newshour/show/trump-and-his-children-accused-of-using-charitable-foundation-like-a-piggy-bank)\n\n>[Trump Broke The Law In Freezing Ukraine Funds, Watchdog Report Concludes ](https://www.npr.org/2020/01/16/796806517/trump-broke-the-law-in-freezing-ukraine-funds-watchdog-report-concludes)\n\n>[Trump formally ordered to pay $454 million in New York fraud case ](https://www.reuters.com/world/us/trump-hit-with-454-mln-judgment-new-york-fraud-case-2024-02-23/)\n\n>[Judge finalizes $25 million settlement for 'victims of Donald Trump's fraudulent university' ](https://abcnews.go.com/US/judge-finalizes-25-million-settlement-victims-donald-trumps/story?id=54347237)\n\n>[Judge signs off on shutdown of Trump Foundation after ‘pattern of illegality’ ](https://www.theguardian.com/us-news/2018/dec/18/trump-foundation-shutdown-lawsuit)\n\n>[Inside the government’s racial bias case against Donald Trump’s company](https://www.washingtonpost.com/politics/inside-the-governments-racial-bias-case-against-donald-trumps-company-and-how-he-fought-it/2016/01/23/fb90163e-bfbe-11e5-bcda-62a36b394160_story.html)\n\n>[Trump hit with $354.9 million penalty, 3-year ban in NY civil fraud case](https://www.reuters.com/legal/judge-set-rule-trumps-370-million-civil-fraud-case-2024-02-16/)\n\n>[Jury finds Donald Trump sexually abused E. Jean Carroll in civil case, awards her $5 million ](https://www.cnn.com/2023/05/09/politics/e-jean-carroll-trump-lawsuit-battery-defamation-verdict/index.html)\n\n>[Judge clarifies: Yes, Trump was found to have raped E. Jean Carroll](https://www.washingtonpost.com/politics/2023/07/19/trump-carroll-judge-rape/)\n\n>[Trump Ordered to Pay $83.3M in Sexual Assault Defamation Case ](https://www.voanews.com/a/jury-begins-deliberations-in-trump-sexual-assault-defamation-case-/7458971.html)\n\n>[Trump becomes first former US president convicted of felony crimes](https://apnews.com/article/trump-trial-deliberations-jury-testimony-verdict-85558c6d08efb434d05b694364470aa0)\n\nWas the Justice Department suing him for racial discrimination back in the 70s a partisan attack as well?", "score": 1, "created_utc": 1732728519.0}, {"username": "Dianneis", "type": "comment", "content": "Well, not all of us.\n\n[Trump campaign leaving some cities with hundreds of thousands in unpaid bills after rallies](https://abcnews.go.com/Politics/trump-campaign-leaving-cities-hundreds-thousands-unpaid-bills/story?id=115415455)\n\n[The billionaire who doesn't pay up: Trump's trail of unpaid bills](https://www.usatoday.com/story/news/2016/06/09/news-roundup-trump-stanford/85651072/)\n\n>Donald Trump casts himself as a protector of workers and jobs, but a USA TODAY NETWORK investigation found hundreds of people — carpenters, dishwashers, painters, even his own lawyers — who say Trump didn’t pay them for their work. A review of about 60 lawsuits and hundreds of liens alleging Trump hasn’t paid suggest that either his companies are bad at hiring workers and assessing contractors, or that they renege on contracts, refuse to pay or consistently attempt to change payment terms after work is complete. Trump's business has even been accused of not passing along tips to wait staff...", "score": 38, "created_utc": 1732644979.0}, {"username": "Dianneis", "type": "comment", "content": "Overspending is a cardinal sin with these people. That's why they voted to reelect this guy:\n\n[Donald Trump Built a National Debt So Big (Even Before the Pandemic) That It’ll Weigh Down the Economy for Years](https://www.propublica.org/article/national-debt-trump)", "score": 4, "created_utc": 1732644160.0}, {"username": "Dianneis", "type": "comment", "content": "He didn't just pay off a porn star. He broke the law while doing it. 34 times, too, and that's in addition to all the other crimes like these:\n\n>[Trump Org. fined $1.6 million after conviction for 17 felonies, including tax fraud](https://www.cnn.com/2023/01/13/politics/trump-org-sentencing/index.html)\n\n>[Trump Broke The Law In Freezing Ukraine Funds, Watchdog Report Concludes ](https://www.npr.org/2020/01/16/796806517/trump-broke-the-law-in-freezing-ukraine-funds-watchdog-report-concludes)\n\n>[Trump formally ordered to pay $454 million in New York fraud case ](https://www.reuters.com/world/us/trump-hit-with-454-mln-judgment-new-york-fraud-case-2024-02-23/)\n\n>[Judge finalizes $25 million settlement for 'victims of Donald Trump's fraudulent university' ](https://abcnews.go.com/US/judge-finalizes-25-million-settlement-victims-donald-trumps/story?id=54347237)\n\n>[Judge signs off on shutdown of Trump Foundation after ‘pattern of illegality’ ](https://www.theguardian.com/us-news/2018/dec/18/trump-foundation-shutdown-lawsuit)\n\n>[Inside the government’s racial bias case against Donald Trump’s company](https://www.washingtonpost.com/politics/inside-the-governments-racial-bias-case-against-donald-trumps-company-and-how-he-fought-it/2016/01/23/fb90163e-bfbe-11e5-bcda-62a36b394160_story.html)\n\n>[Trump hit with $354.9 million penalty, 3-year ban in NY civil fraud case](https://www.reuters.com/legal/judge-set-rule-trumps-370-million-civil-fraud-case-2024-02-16/)\n\nI mean, you're having a problem with an illegal migrant charged – not convicted, mind you – with rape, and then you claim that two separate unanimous convictions (plus dozens of other similar accusations that are twice as long as the list above) are not indicative of anything and dismiss real, proven felony convictions as some nonsense. \n\nUndocumented immigrants are all felons (even though the vast majority of them committed no felonies or other crimes getting here), but an actual convicted felon with a rich history of fraud and other crimes isn't? I honestly do not get the logic behind this. Even if you consider Trump as \"your guy\", I can't imagine defending any of \"my guys\" after doing anything close to this.", "score": 5, "created_utc": 1732643050.0}, {"username": "Dianneis", "type": "comment", "content": "Yeah, this is nothing. He used to spy on naked young girls when he was younger.\n\n[Teen Beauty Queens Say Donald Trump Walked in on Them Changing When They Were as Young as 15](https://people.com/politics/donald-trump-walks-in-miss-teen-usa-contestants-changing/)\n\n>“He just came strolling right in. There was no second to put a robe on or any sort of clothing or anything. Some girls were topless. Others girls were naked. Our first introduction to him was when we were at the dress rehearsal and half-naked changing into our bikinis.”\n\n[Trump told Stern he walked backstage when beauty queens were naked](https://thehill.com/blogs/ballot-box/presidential-races/300093-trump-confirms-he-walked-backstage-when-beauty-queens/)\n\n>“No men are anywhere, and I’m allowed to go in, because I’m the owner of the pageant and therefore I’m inspecting it. … ‘Is everyone OK?’ You know, they’re standing there with no clothes. ‘Is everybody OK?’ And you see these incredible-looking women, and so I sort of get away with things like that.”\n\n>– Donald J. Trump, 2005", "score": 26, "created_utc": 1732637918.0}, {"username": "Dianneis", "type": "comment", "content": "He already has a token black guy in the cabinet, though.\n\nEDIT: this is not the title, by the way. The actual title:\n\n>Will Donald Trump Pardon Diddy? Former Employee Weighs In", "score": 8, "created_utc": 1732465004.0}, {"username": "Dianneis", "type": "comment", "content": "In what possible way is quoting her own words is \"fake news\"? Do tell.\n\nNext thing you know, you'll be dismissing this as fake news as well:\n\n>\"Look, there is no question in my mind that Donald Trump is unfit to serve as president and commander in chief. I've said this over and over again.\"\n\n>– Tulsi Gabbard, Dec 23, 2019", "score": 36, "created_utc": 1732464305.0}, {"username": "Dianneis", "type": "comment", "content": ">In almost every foreign conflict in which Russia had a hand, Gabbard backed Moscow and railed against the US. Her past promotion of Kremlin propaganda has caused significant opposition on both sides of the aisle to her nomination \\[and\\] earned her praise in Russian state media.\n\nThat's cute, but still nearly nothing compared to her treasonous boss.\n\n>[Trump calls Putin ‘genius’ and ‘savvy’ for Ukraine invasion](https://www.politico.com/news/2022/02/23/trump-putin-ukraine-invasion-00010923)\n\n>[Trump Broke The Law In Freezing Ukraine Funds, Watchdog Report Concludes ](https://www.npr.org/2020/01/16/796806517/trump-broke-the-law-in-freezing-ukraine-funds-watchdog-report-concludes)\n\n>[Trump says he would encourage Russia to ‘do whatever the hell they want’ to any NATO country that doesn’t pay enough](https://www.cnn.com/2024/02/10/politics/trump-russia-nato/index.html)\n\n>[Trump campaign’s Russia contacts ‘grave’ threat, \\[Republican-led\\] Senate says](https://apnews.com/article/ap-top-news-international-news-elections-politics-campaigns-5e833a62e9492f6a66624b7920cc846a)\n\n>[Senate Report: Former Trump Aide Paul Manafort Shared Campaign Info With Russia](https://www.npr.org/2020/08/18/903512647/senate-report-former-trump-aide-paul-manafort-shared-campaign-info-with-russia)\n\n>[Trump sides with Putin over US intelligence](https://www.cnn.com/2018/07/16/politics/donald-trump-putin-helsinki-summit/index.html)\n\n>[Trump revealed highly classified information to Russian foreign minister and ambassador](https://www.washingtonpost.com/world/national-security/trump-revealed-highly-classified-information-to-russian-foreign-minister-and-ambassador/2017/05/15/530c172a-3960-11e7-9e48-c4f199710b69_story.html)\n\n>[Vladimir Putin Cultivated Donald Trump as 'Source': Ex-CIA Director](https://www.newsweek.com/putin-trump-source-cia-director-1967549)\n\n>[‘The perfect target’: Russia cultivated Trump as asset for 40 years – ex-KGB spy](https://www.theguardian.com/us-news/2021/jan/29/trump-russia-asset-claims-former-kgb-spy-new-book)\n\n>[How Russian Money Helped Save Trump’s Business](https://foreignpolicy.com/2018/12/21/how-russian-money-helped-save-trumps-business/)", "score": 308, "created_utc": 1732463938.0}, {"username": "Redclayblue", "type": "comment", "content": "‘I’m Donald Trump, and I approve this mess.’", "score": 0, "created_utc": 1727668284.0}, {"username": "R_Lennox", "type": "comment", "content": "Multiple news sites posted this. [Google searches on changing their vote]( https://newrepublic.com/post/188357/donald-trump-search-term-change-vote) after the election.\n\n> Donald Trump voters are having a shocking bout of buyer’s remorse now that their candidate is slated for a second term.\n\n>On Election Day and in the hours following, searches for “how to change my vote” spiked in states that the president-elect won, according to Google analytics. The searches first surged the morning of Election Day before declining the day afterward. Interest in the phrase was not short-lived, though, with numbers climbing again on Monday—just shy of a week out from the election—and continuing to grow throughout the week. The apparent change of heart comes after Trump allies had admitted Project 2025 was the plan all along, and after women and girls became the target of an overtly misogynistic, far-right campaign claiming ownership of their bodies.", "score": 2, "created_utc": 1731953450.0}, {"username": "KeDoG3", "type": "comment", "content": "This needs to be made clear to everyone. We need to have united messaging around this and not just say this on reddit but everyone in our personal lives, repeating it constantly.\n\nDonald Trump is a threat to every non-multi millionaire American's economic stability and future. Donald Trump's policies will make you poorer, will likely cost you your job, and will leave you without any safety net to be able to provide for yourself or your family. And because of this you and your loved ones will likely be homeless, starving to death, or if you are lucky used as in essence slave labor. He is a clear and present danger to the life of you and your loved ones and it doesn't matter if you voted for him or not.", "score": 6, "created_utc": 1732584294.0}, {"username": "deviousmajik", "type": "comment", "content": "Donald Trump", "score": 2, "created_utc": 1731962601.0}, {"username": "Schmetterlingus", "type": "comment", "content": "My fwends all hate my bigotry. Under Donald trump we will make it illegal to not talk to me when I explain fascist policies to you\n\n-Vance probably", "score": 3, "created_utc": 1727836333.0}, {"username": "TheParadoxigm", "type": "comment", "content": "Counter point: \"President Donald Trump\"", "score": 1, "created_utc": 1731451245.0}, {"username": "Iam_nighthawk", "type": "comment", "content": "While I don’t totally disagree with you, this is not a two sides situation. Donald trump and his people don’t believe in democracy. They will be worse for Palestine. They will make corporate America richer. Democratic policies are better for the working class - but their messaging sucks. I would much rather have Bernie or AOC in office than trump, Biden, or Kamala.", "score": 1, "created_utc": 1732461203.0}, {"username": "Iam_nighthawk", "type": "comment", "content": "Have you read project 2025? Because I have. And if you read that, and you still voted for donald trump - you support fascism.", "score": 1, "created_utc": 1732459599.0}, {"username": "GetReady4Action", "type": "comment", "content": "I’ve had two women accept the nomination for president in my lifetime. both of them have lost to Donald Trump. this shit is fucking sad.", "score": 21, "created_utc": 1730875024.0}, {"username": "Attorney_For_Me", "type": "comment", "content": "[Donald Trump started playing music again in Michigan and people are leaving. Many Are Going Away.](https://www.threads.net/@brittainforsenate/post/DBknY4LpFMq?xmt=AQGz6XKjcAregPaqb98BNp2AgsKzMQeOlMltCpL7hxaQKg)", "score": 15, "created_utc": 1729913978.0}, {"username": "angrypooka", "type": "comment", "content": "“I SUSPECT,” DONALD TRUMP RECENTLY told House Republicans, that “I won’t be running again unless you say, ‘He’s so good we’ve got to figure something else out.’” \n\nI predict 2 years from now this country will be in such a bad state, as well as Trump’s mental state, that no one will be saying that.", "score": 24, "created_utc": 1732392897.0}, {"username": "britgun", "type": "comment", "content": "Donald Trump is just weak and wrong in general", "score": 8, "created_utc": 1726020136.0}, {"username": "ChrisIsUninteresting", "type": "comment", "content": "> Donald Trump 'will hurt America' ~~if he allows Putin to win in Ukraine~~\n\nFTFY\n\nAnd, tbf, he already is, and has been for decades, sooo....", "score": 2, "created_utc": 1731258668.0}, {"username": "ChrisIsUninteresting", "type": "comment", "content": "The only thing Donald Trump has earned the right to do is rot in a jail cell for the rest of his life, JD.", "score": 9, "created_utc": 1727835444.0}, {"username": "Ssshizzzzziit", "type": "comment", "content": "I don't know where you live. I don't know where your cousins live. \n\nAsk yourself if where you're at has enough job opportunities. Is it a right to work state like Florida that is setup to race to the bottom as far as wages and hours are concerned? Is it a small town with one major employer? Look at your representatives and see how they're voting, and what they're voting for. There are a lot of reasons why someone would be out of work or struggling to get work that doesn't have anything to do with who's president. \n\nI'd also argue, if you're having trouble buying milk, and you're employed then there is a real problem there, no matter who's in the office. Concerning the price of milk, a gallon costs me $4.59 at our local store or with a Costco membership around 3.20 (of course threw out the receipt -- I just went yesterday.) I don't know your situation, but how much cheaper do you expect milk to be? I have two small children who plow through it, so I get it -- but I don't expect it to be under $3.00. \n\n\nI can say yes, the one person who had a significant impact on prices, for us anyway, over the last five years is Donald Trump. His dismissal of Covid and his mishandling of a catastrophe is what caused my prices to rise. Because he's a total bumbling dipshit laser focused on his reputation and surrounds himself with yes-men, catastrophies are going to sneak up on him that most would see coming a mile away. A global pandemic is one where a presidency can turn bad. I can think of a few others that he'll be blindsided by. Say what you will about Biden, but he was on the job. \n\n\nNo, I don't think Harris was lying. I get the feeling that Biden is fine in the job. He's old. He's diminish. He's tired. **I don't believe he's senile.** He has been effective at minimizing the hurt from the supply chain disruption before his presidency. I think he's been effective at infrastructure spending. He tried to help those caught up in crushing debt. His job numbers have been consistently good, but I get it's not going to be great everywhere. He's done everything in his power to actually help working class people and Republicans have done everything they can to stop him -- and Republicans were rewarded for it. \n\n\nThe reasons are not because of the price of milk, or anything economic related.", "score": 1, "created_utc": 1732122473.0}, {"username": "InvadedByMoops", "type": "comment", "content": "> should we not hold Doug to the same standard?\n\nSure. Doug Emhoff and Donald Trump should not be president. Agree?", "score": 5, "created_utc": 1727933920.0}, {"username": "zoloft4breakfast", "type": "comment", "content": "I am scared. My family has gone insane, constantly watching Fox News, it is seriously mind-boggling and terrifying. I can't even oppose them scary. Please everyone vote for not Donald Trump.", "score": 2, "created_utc": 1729124398.0}, {"username": "IPA__________Fanatic", "type": "submission", "content": "Donald Trump Mocked After Offering to Sign a Prayer Book for a Rabbi at October 7 Anniversary Event ", "score": 1, "created_utc": 1728397573.0}, {"username": "enterprisevalue", "type": "comment", "content": "And that has always been happening. When has the army not been in power in Pakistan?\n\nEvery prime minister has been elected because the army wanted him/her to.\n\nDo you really think Imran Khan would have won the elections in 2018 if Nawaz Sharif hadnt been disqualified and the army didn't back him? \n\nAnd on the no confidence, which MNA was forced to do so? IKs government was a coalition anyway and the others wanted him out. There's no conspiracy here. Pakistani politicians and the judiciary have kept him out.\n\nThe cipher? What is so controversial about it. The US wanted Pakistan to ally with it against Russia. The US hates Russia and it wants everyone to hate it. Pakistan is free to go against it but then it gets isolated by the US and our establishment isn't going to let that happen because that'll be the end of them.\n\nAnyways all this to say, if in 2024 you think that Donald Trump is better than the Democrats for anyone that isn't rich and powerful, then ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯", "score": 1, "created_utc": 1730596552.0}, {"username": "spherocytes", "type": "comment", "content": "1. Muslim voters in Michigan, upset at how the Biden/Harris administration is/was handling the Israel-Palestinian conflict either don’t vote or vote for Trump to “punish” Kamala. \n\n2. Because of this, this type of messaging helps get Donald Trump, someone who wanted Israel to “finish the job”, elected as the 47th President of the US. \n\n3. With the nomination of Mike Huckabee, who doesn’t even acknowledge the existence of the West Bank, it’s clear Trump is going to stay true to his word in letting Israel “finish the job.” And the only people the MI Muslim community punished is their Palestinian brethren.", "score": 7, "created_utc": 1731691895.0}, {"username": "spherocytes", "type": "comment", "content": "> It’s been eight years since leaked audio from a conversation between Donald Trump and TV host Billy Bush made waves for the former president’s descriptions of kissing and grabbing women without their consent.\n\n> Now, young people are encountering the tape for the first time on TikTok, where users are sharing videos of their reactions and, in some cases, reaching large audiences.\n\n> Many first-time voters were young teens in 2016 when The Washington Post first reported the incident, in which the former president seemed to endorse sexual assault during a behind-the-scenes conversation on an “Access Hollywood” set when he didn’t realize his microphone was on. Despite widespread criticism of Trump’s comments at the time, he went on to win the 2016 presidential election, and the mainstream news cycle moved on.\n\n> In this video from 2005, Donald Trump prepares for an appearance on \"Days of Our Lives\" with Access Hollywood host Billy Bush and actress Arianne Zucker. (Video: Obtained by The Washington Post)\n\n> Now, the generation that came of age during the #MeToo era is turning to social media for information about candidates and elections — 39 percent of young adults say they frequently get their news from TikTok, according to Pew Research. This week, many said on the social network they were shocked by the former president’s words and confused why the episode wasn’t a dealbreaker in 2016.\n\n> “I don’t think any of my friends had heard it,” said Kate Sullivan, a 21-year-old student in Ohio who heard the tape for the first time on her TikTok For You feed this week. “We all felt equally shocked.”\n\n> People her age have less tolerance for sexual misconduct after growing up amid a series of high-profile harassment and assault cases involving major celebrities, Sullivan said. She immediately felt compelled to share the audio in her own video, with the superimposed text, “Fathers are voting for this man.” The video has been viewed 2.5 million times and was reshared by singer Billie Eilish to her 68 million followers.\n\n> Brigid Quinn, a 15-year-old in Georgia, knew that Trump had been accused of making sexist comments, she said. But she had never heard the words he actually said — including the ‘grab them by the pussy’ quote. She “didn’t understand how people thought this was normal.”\n\n> She made her own video featuring Trump’s audio in hopes her school friends of voting age would see it.\n\n> “I’m around a lot of [18-year-olds] on my sports team, and I thought maybe I could show them who to vote for,” she said. Some people came up to her at school saying her TikTok was the first they had ever heard of the tape.\n\n> This election season, Trump’s and Vice President Kamala Harris’s campaigns have run sprawling operations on TikTok, both posting to their own accounts and paying influencers to reach the video app’s large share of Gen Z and millennial users. Notably, TikTok is the only platform that confirmed to The Post that users can use the word “vote” in their videos without being suppressed. But neither candidate can control the narrative on the app’s algorithmic feed, where videos shoot to viral fame regardless of whether they’re tied to the current news cycle.\n\n> The infamous tape came about a month before the 2016 presidential election and set off a crisis within the Republican Party, which was already grappling with Trump’s insurgent campaign. Trump apologized for his comments in the video but also sought to downplay them as “locker room banter.”\n\n> A number of prominent Republicans announced they were no longer supporting Trump, and some even called on him to end his candidacy. The Republican speaker of the House at the time, Paul D. Ryan of Wisconsin, said he was “sickened” by the tape and told colleagues he would no longer defend Trump.\n\n> Now, Trump is running for president with the backing of the Republican Party. But in the internet era, content never dies. Some social media users must carefully manage their so-called digital footprints to avoid blowback from colleges, jobs or their social circles. The same goes for public figures. In July, for example, the personal blog that vice-presidential nominee JD Vance kept during college made the rounds on X.\n\n> News cycles on social media often take their cues from evocative posts and videos, rather than the mainstream media.\n\n> “Thanks to social apps, things that weren’t necessarily relevant for one election cycle may come back to haunt in subsequent election cycles,” said Jeffrey Blevins, a professor of journalism and political science at University of Cincinnati.\n\n> Some of the trending “Access Hollywood” TikToks came from older users who heard Trump’s comments the first time around. But for people like Sullivan, who will vote for the first time in Tuesday’s election, the discovery cast both the 2016 and 2024 elections in a new light.\n\n> Did people know about the tape before they voted in 2016? she asked a Post reporter.\n\n> Yes, the tape came out before Election Day.\n\n> “I just recently got into politics,” she said. “The fact that people knew about this, and he still won, is pretty wild to me.”", "score": 543, "created_utc": 1730507691.0}, {"username": "spherocytes", "type": "comment", "content": "1. The majority of the voting bloc of white women in the USA cast their vote for Donald Trump. Most of them focused on the economy and ignored all the other policy issues Trump pledged to bring about as President. \n\n2. Trump’s Supreme Court strikes down *Roe* and negatively impacts the economy anyways. \n\n3. After this, white women realize that they, too, are now victims of their own  votes and willful disregard of all of Trump’s other policies. Many of them facing the reality that they and their daughters now have significantly less rights and the economy still isn’t better because of Trump.", "score": 29, "created_utc": 1728914087.0}, {"username": "spherocytes", "type": "comment", "content": "1. Republican officials (and those that voted for Republicans) cut FEMA funding and supported Donald Trump despite his continuous lies. \n2. Trump continues to lie, leading to massive amounts of misinformation being spread and further causing chaos during multiple natural disasters. \n3. Continuing to spread hi lies, Trump's words unfortunately leads to the death of many people in Red states. Which means Republicans are choosing policies and a man who are actively hurting their own constituents.", "score": 35, "created_utc": 1728556437.0}, {"username": "spherocytes", "type": "submission", "content": "LeBron James Endorses Kamala Harris, Slams Donald Trump’s Racist Rhetoric ", "score": 272, "created_utc": 1730414449.0}, {"username": "spherocytes", "type": "submission", "content": "LeBron James Endorses Kamala Harris, Slams Donald Trump’s Racist Rhetoric ", "score": 4692, "created_utc": 1730414410.0}, {"username": "Icedoverblues", "type": "comment", "content": "Was that before or after he supported a guy known for sexually assaulting women and little girls? Donald Trump is the rapist I'm referring to.", "score": 16, "created_utc": 1732417524.0}, {"username": "Icedoverblues", "type": "comment", "content": "Population growth and only a certain group was in action to be killed. That's just a historical fact. What does the Pentagon have to do with that when the statistical analysts of COVID are well publicized but largely ignored by Maga assholes.\n\n\n* Correction: Mega assholes that support donald trump's bitch ass", "score": 20, "created_utc": 1732374886.0}, {"username": "dr239", "type": "comment", "content": "Clearly I'm not Joe Biden. And I'm CERTAINLY not Donald Trump.\n\n*Mic drop*", "score": 10, "created_utc": 1726021565.0}, {"username": "Prophet92", "type": "comment", "content": "Breaking: Donald Trump denies friendship with former business partner Jacob Marley, currently refusing to meet with him and what Trump describes as “three radical liberal ghosts” ahead of holiday season.\n\n\nRelated news: Trump expected to name New York businessman Henry F. Potter as his HUD secretary.", "score": 10, "created_utc": 1731544440.0}, {"username": "lovinbagels", "type": "comment", "content": "let me ignore this valid question and lets focus on what really matters, my rallies - donald trump", "score": 8, "created_utc": 1726018226.0}, {"username": "Jackpot777", "type": "comment", "content": "[Trump claims responsibility for US withdrawal from Afghanistan in resurfaced footage - Monday 16 August 2021](https://www.the-independent.com/tv/news/trump-claims-responsibility-for-us-withdrawal-from-afghanistan-in-resurfaced-footage-b2178721.html)\n\n---\n\nFootage of Donald Trump taking credit for the withdrawal of US troops from Afghanistan has resurfaced after the Taliban seized control of Kabul.\n\nThe former president has also called on Joe Biden to resign describing the current situation as a “disgrace” and calling it “one of the greatest defeats in American history”.\n\nHowever, Mr Trump has been criticised himself for his administration’s role in withdrawing the troops and speaking at a rally on 26 June, even stated that he “started the process” and claimed Biden “couldn’t stop it” if he “wanted to”.\n\n---\n\n[Literal video of Trump saying it in public](https://www.c-span.org/video/?c4973586/user-clip-i-started-process-troops-coming-back-home) in Wellington, Ohio.", "score": 2, "created_utc": 1732538044.0}, {"username": "Jackpot777", "type": "comment", "content": "Anyone that voted to have this done to them or their loved one and is looking for sympathy? I'll help you find sympathy. It's in the dictionary between shit and syphilis. \n\nFuck your feelings, was that it? Trump 2024 fuck your feelings? Was that it?\n\nThat was it.", "score": 1, "created_utc": 1732151053.0}, {"username": "jo_maka", "type": "submission", "content": "Donald Trump Faces Travel Ban To 38 Countries ", "score": 42231, "created_utc": 1717161218.0}, {"username": "Real-Work-1953", "type": "comment", "content": "Exactly. Remember this. Remember it most of all. In the next few years, we’ll be told that pictures like these are not the standard and that we should shut the fuck up and just be resigned to the Trump Era. \n\nThis picture is the standard. Donald Trump is nowhere near it and never will be, even if he is President.", "score": 45, "created_utc": 1731037260.0}, {"username": "Real-Work-1953", "type": "submission", "content": "Texas offers Donald Trump huge ranch for mass deportation plan ", "score": 1155, "created_utc": 1732113527.0}, {"username": "Real-Work-1953", "type": "submission", "content": "Donald Trump looking like a supervillain ", "score": 2353, "created_utc": 1731781612.0}, {"username": "Real-Work-1953", "type": "submission", "content": "We can rage about Donald Trump. Or we can be curious about why he appealed to so many ", "score": 483, "created_utc": 1731282310.0}, {"username": "Captain_Smartass_", "type": "submission", "content": "David Letterman Exposes Donald Trump ", "score": 144, "created_utc": 1729595300.0}, {"username": "IcyPyroman1", "type": "comment", "content": "Donald Trump was around 18 when Jim Crow law ended its absolutely crazy that he was probably in the forefront saying the law should stay in place.", "score": 4, "created_utc": 1730248208.0}, {"username": "MeiIsBaePrayForMe", "type": "comment", "content": "“DONALD TRUMP WAS FIRED BY 81 MILLION PEOPLE” GOOD FUCKIN NIGHT", "score": 29, "created_utc": 1726019712.0}, {"username": "riccarjo", "type": "comment", "content": "Last post was 4 years ago and then \"Trump 2024!\" today.   Low effort bots now man", "score": 9, "created_utc": 1730829067.0}, {"username": "flouncindouchenozzle", "type": "submission", "content": "Donald Trump Mukbang ", "score": 5, "created_utc": 1655602899.0}, {"username": "MiamiViceTC", "type": "comment", "content": "Today the prophecy completes itself \"If we nominate Donald Trump we will get destroyed, and we will deserve it.\"", "score": 18, "created_utc": 1730838922.0}, {"username": "MiamiViceTC", "type": "comment", "content": "Today is the day Donald Trump loses to a black woman and fly's to Hungary overnight.", "score": 22, "created_utc": 1730821524.0}, {"username": "Siicktiits", "type": "comment", "content": "Biden was losing badly, but not because the people who would vote democrat were voting for trump all of a sudden, they just weren't going to vote at all. Harris being announced showed those people that this is actually something worth fighting for. Ironically I think that a large portion of the MAGA base are doing the same thing and aren't going to show up like they did in 2016. They will still say TRUMP 2024 and be loud and obnoxious in conversations, but I don't think Mike the 35 year old white dude who does AC repair even bothered to make sure he was registered to vote, let alone vote early, or miss out on an hour of wages to vote tomorrow morning. I think a lot of \"Trump households\" will be secretly divided, women aren't this meek object like the MAGGOTS believe their wives to be.", "score": 1, "created_utc": 1730758837.0}, {"username": "JpstrMik", "type": "comment", "content": "\"The Vice president doesn't do anything\" (paraphrase)\n- Donald Trump", "score": 2, "created_utc": 1726022657.0}, {"username": "Whale_Scrotum", "type": "submission", "content": "Donald Trump when his debate opponent isn’t senile ", "score": 5080, "created_utc": 1726018988.0}, {"username": "ApprehensivePlum1420", "type": "comment", "content": "Disproved by whom? Donald Trump?\n\nThe vast majority of empirical studies on homlessness have pointed to the cost of living/ housing cost as the primary driver.", "score": 18, "created_utc": 1732633632.0}, {"username": "Shuk", "type": "comment", "content": "Donald Trump is a fucking idiot. This is going to tank the economy. People will lose jobs and things will get more expensive. Everyone who thought he would be good for the economy is a fool.", "score": 3, "created_utc": 1732589242.0}, {"username": "Shuk", "type": "comment", "content": "I have this gut theory that there is a lot of unserious anti-Harris sentiment out there. People that are generally angry with the state of things like grocery prices, that may express some anti-Biden/Harris sentiment, but when the voting booth is staring them down, and they are making plans to put pencil to ballot, they might think \"what am I really doing?\" when looking at Donald Trump and seeing his clown behaviour, or it becoming clear that their alternative to Harris is endorsing fascism, the thing they know is bad.\n\nMy theory is that what could explain an uptick for Harris in the closing days. The reality setting in being like \"maybe I really should just vote for the normal person\".", "score": 22, "created_utc": 1730515774.0}, {"username": "Shuk", "type": "comment", "content": "I have this gut theory that there is a lot of unserious anti-Harris sentiment out there. People that are generally angry with the state of things like grocery prices, that may express some anti-Biden/Harris sentiment, but when the voting booth is staring them down, and they are making plans to put pencil to ballot, they might think \"what am I really doing?\" when looking at Donald Trump and seeing his clown behaviour, or it becoming clear that their alternative to Harris is endorsing fascism, the thing they know is bad.\n\nMy theory is that what could explain an uptick for Harris in the closing days. The reality setting in being like \"maybe I really should just vote for the normal person\".", "score": 19, "created_utc": 1730515605.0}, {"username": "AnalSoapOpera", "type": "submission", "content": "NY AG subpoenas Ivanka Trump and Donald Trump, Jr. in civil investigation ", "score": 11, "created_utc": 1641232589.0}, {"username": "AnalSoapOpera", "type": "submission", "content": "Donald Trump signals at Iowa rally that he intends to run in 2024, teases that his campaign slogan will be 'Make America Great Again, Again' ", "score": 370, "created_utc": 1633891999.0}, {"username": "Doctor_Disco_", "type": "comment", "content": "I try not to get my hopes up but it’s impossible to look at the lack of enthusiasm for Donald Trump compared to the crazy enthusiasm for Kamala Harris and and not feel insanely hopeful", "score": 24, "created_utc": 1730781715.0}, {"username": "Doctor_Disco_", "type": "comment", "content": "If she loses, it certainly won’t be her fault. If this country seriously thinks Donald Trump is more fit to lead us than Kamala Harris, we are lost and we are beyond saving.", "score": 1, "created_utc": 1730586468.0}, {"username": "Doctor_Disco_", "type": "comment", "content": "I never doubted her. All the shit with Brittany Mahomes was so fucking stupid and none of it meant Taylor supported Trump or even likes Brittany.  \n\nI loathe Donald Trump, but my dad is a huge Trump supporter and I absolutely hate every aspect of his politics and I don’t get along with him very well, but I still hug him when I see him. I still spend time with him and I still care about him.", "score": 1, "created_utc": 1726024965.0}, {"username": "Doctor_Disco_", "type": "comment", "content": "I can’t even express with words how much I fucking hate Donald Trump", "score": 28, "created_utc": 1726022785.0}, {"username": "Miss-Tiq", "type": "submission", "content": "Stephen Colbert Pleads for Chris Christie to Not Support Donald Trump ", "score": 1, "created_utc": 1598617649.0}, {"username": "Miss-Tiq", "type": "submission", "content": "Stephen Colbert Pleads for Chris Christie to Not Support Donald Trump ", "score": 3, "created_utc": 1598617617.0}, {"username": "TheTwoWolvesInsideU", "type": "comment", "content": "Of course! Donald Trump had a long standing history of documented racism and sexism, from multiple sexual assaults that the courts have declared him guilty of, to a well charted history of racism from his Central Park 5 accusations to his recent comments on legal Haitian immigrants.\n\nBut that’s just a few. I’m sure a simple google search would return you enough results to realize you’re being a god damn idiot.", "score": 3, "created_utc": 1730878497.0}]